{
  "title": "تفسير المصطلحات",
  "explanations": [
    {
      "term": "عدد أولي",
      "explanation": "العدد الأولي هو عدد طبيعي أكبر من 1 ليس نتاج عددين طبيعيين أصغر. العدد الطبيعي الأكبر من 1 الذي ليس أولياً يُسمى عدداً مركباً."
    },
    {
      "term": "عدد فيثاغورسي أولي",
      "explanation": "العدد الأولي فيثاغورس هو عدد أولي من الشكل 4ن + 1. الأعداد الأولية فيثاغورس هي بالضبط الأعداد الأولية الفردية ب التي يكون 2 جذرًا بدائيًا لها."
    },
    {
      "term": "أعداد فيبوناتشي",
      "explanation": "تتابع يتم فيه إضافة كل عدد إلى العددين السابقين له."
    },
    {
      "term": "أعداد تريبوناتشي",
      "explanation": "تتابع الأعداد الطبيعية الذي يبدأ بالعدد 0 مرة واحدة والعدد 1 مرتين. بعد ذلك، يُحسب كل عدد بجمع الثلاثة أعداد السابقة له مباشرة: T0=0، T1=T2=1، Tn=Tn-1 + Tn-2 + Tn-3."
    },
    {
      "term": "أعداد بل",
      "explanation": "عدد بل هو عدد جميع الأقسام غير المرتبة لمجموعة من n عنصرًا، يرمز له ب Bn، و B0=1 مفترضًا بالتعريف. سمي على اسم إريك بل، الذي درسها في الثلاثينيات."
    },
    {
      "term": "أعداد كاتالان",
      "explanation": "أعداد كاتالان هي تتابع عددي يظهر في العديد من مشاكل التوافقيات. سميت تكريماً للرياضي البلجيكي يوجين تشارلز كاتالان، رغم أنها كانت معروفة لدى ليونارد أويلر. العدد كاتالان n يمكن تعريفه بطرق مكافئة متعددة، مثل: 1) عدد الأقسام لمضلع محدب (n+2) إلى مثلثات بواسطة أقطار غير متقاطعة. 2) عدد الطرق لتوصيل 2ن نقطة على دائرة من n بوتر غير متقاطع، إلخ."
    },
    {
      "term": "أعداد صوفي جيرمان",
      "explanation": "العدد الأولي صوفي جيرمان هو العدد الأولي ب الذي يكون العدد 2ب+1 هو عدد أولي أيضاً. العدد 2ب+1 المرتبط بالعدد الأولي صوفي جيرمان يسمى عدداً أولياً آمناً. على سبيل المثال، 11 هو عدد أولي صوفي جيرمان، و 2 × 11 + 1 = 23 هو العدد الأولي الآمن المرتبط به."
    },
    {
      "term": "أعداد متناظرة",
      "explanation": "الأعداد المتناظرة هي: 1) جميع الأعداد ذات رقم واحد، 2) الأعداد المكونة من رقمين من الشكل xx، و 3) الأعداد المكونة من ثلاثة أرقام من الشكل xyx، حيث x و y أرقام و x لا يمكن أن يكون 0."
    }
  ],
  "prefixToLink": "لمزيد من المعلومات المثيرة عن تتابعات الأعداد السحرية يمكنكم زيارة ويكيبيديا والموقع"
}