{
  "title": "Обяснение на термините",
  "explanations": [
    {
      "term": "Просто число",
      "explanation": "Просто число е естествено число по-голямо от 1, което не е произведение на две по-малки естествени числа. Естествено число по-голямо от 1, което не е просто, се нарича съставно число."
    },
    {
      "term": "Питагорейско просто число",
      "explanation": "Питагорейско просто число е просто число от вида 4n + 1. Питагорейските прости числа са точно нечетните прости числа p, за които 2 е примитивен корен по модул p."
    },
    {
      "term": "Числа на Фибоначи",
      "explanation": "Последователност, в която всяко число е сума от двете предходни."
    },
    {
      "term": "Числа на Трибоначи",
      "explanation": "Последователност от естествени числа, която първоначално започва с числото 0 веднъж и числото 1 два пъти. След това сумата от трите предходни числа води до числото, което веднага следва: T0=0, T1=T2=1, Tn=Tn-1 + Tn-2 + Tn-3."
    },
    {
      "term": "Числа на Бел",
      "explanation": "Числото на Бел е броят на всички неупорядъчени разпределения на множество от n елементи, обозначено с Bn, с B0=1, прието по дефиниция. Наречени са в чест на Ерик Бел, който ги е изучавал през 1930-те години."
    },
    {
      "term": "Числа на Каталана",
      "explanation": "Числата на Каталана са числов ред, който се среща в много комбинаторни проблеми. Наречени са в чест на белгийския математик Южен Шарл Каталан, въпреки че са били известни на Леонард Ойлер. n-тото число на Каталана Cn може да бъде дефинирано по няколко равностойни начина, като: 1) Броят на разпределенията на изпъкнал (n+2)-ъгълник в триъгълници чрез неразрязващи се диагонали. 2) Броят на начините за свързване на 2n точки на кръг чрез неразрязващи се акорди и др."
    },
    {
      "term": "Числа на Софи Жермен",
      "explanation": "Просто число на Софи Жермен е такова просто число p, че числото 2p+1 също е просто. Числото 2p+1, свързано с просто число на Софи Жермен, се нарича безопасно просто число. Например, 11 е просто число на Софи Жермен, и 2 × 11 + 1 = 23 е свързаното безопасно просто число."
    },
    {
      "term": "Симетрични числа",
      "explanation": "Симетричните числа са: 1) всички едноцифрени числа, 2) двуцифрени числа от вида xx, и 3) трицифрени числа от вида xyx, където x и y са цифри, и x не може да бъде 0."
    }
  ],
  "prefixToLink": "Повече интересна информация за магически редове от числа вижте в Уикипедия и на сайта"
}