{
  "title": "শর্ত ব্যাখ্যা",
  "explanations": [
    {
      "term": "মৌলিক সংখ্যা",
      "explanation": "মৌলিক সংখ্যা হল প্রাকৃতিক সংখ্যা যা 1 এর চেয়ে বড় এবং এটি দুটি ছোট প্রাকৃতিক সংখ্যার গুণফল নয়। 1 এর চেয়ে বড় যা মৌলিক নয় এমন একটি প্রাকৃতিক সংখ্যাকে যৌগিক সংখ্যা বলা হয়।"
    },
    {
      "term": "পিথাগোরিয়ান মৌলিক সংখ্যা",
      "explanation": "একটি পিথাগোরিয়ান মৌলিক সংখ্যা হল 4n + 1 এর আকারের একটি মৌলিক সংখ্যা। পিথাগোরিয়ান মৌলিক সংখ্যা হল সঠিকভাবে বিজোড় মৌলিক সংখ্যা p যার জন্য 2 একটি প্রিমিটিভ রুট মডুলো p।"
    },
    {
      "term": "ফিবোনাচি সংখ্যা",
      "explanation": "একটি অনুক্রম যেখানে প্রতিটি সংখ্যা দুটি পূর্ববর্তী সংখ্যার যোগফল"
    },
    {
      "term": "ট্রিবোনাচি সংখ্যা",
      "explanation": "প্রাকৃতিক সংখ্যার একটি ক্রম যা মূলত 0 একবার এবং 1 দুইবার দিয়ে শুরু হয়। পরে, তিনটি পূর্ববর্তী সংখ্যার যোগফলটি অবিলম্বে অনুসরণ করে সংখ্যা ফলাফলের ফলাফল: T0=0, T1=T2=1, Tn=Tn-1 + Tn-2 + Tn-3"
    },
    {
      "term": "বেল সংখ্যা",
      "explanation": "বেল সংখ্যা হল একটি n-উপাদান সেটের সমস্ত অর্ডারহীন পার্টিশনের সংখ্যা, Bn দ্বারা সূচিত, B0=1 যা সংজ্ঞা দ্বারা অনুমিত। এরিক বেলের নামে নামকরণ করা হয়েছে, যিনি 1930 এর দশকে তাদের পড়াশোনা করেছিলেন।"
    },
    {
      "term": "ক্যাটালান সংখ্যা",
      "explanation": "ক্যাটালান সংখ্যা হল অনেক সমন্বয় সমস্যার মধ্যে পাওয়া একটি সংখ্যাসূচক ক্রম। তারা বেলজিয়ান গণিতবিদ ইউজেন চার্লস কাতালানের সম্মানে নামকরণ করা হয়েছে, যদিও তারা লিওনার্ড ইউলারের কাছে পরিচিত ছিল। এন ক্যাটালান সংখ্যা Cn একাধিক সমতুল্য উপায়ে সংজ্ঞায়িত করা যেতে পারে, যেমন: 1) অবিচ্ছিন্ন কর্ড দ্বারা ত্রিভুজগুলিতে একটি উত্তল (n+2)-গণ বিভাগগুলির সংখ্যা। 2) একটি বৃত্তের 2n পয়েন্টগুলিকে n দ্বারা অ-ছেদকারী কর্ড দ্বারা সংযোগ করার সংখ্যা।"
    },
    {
      "term": "সোফি জার্মেইন সংখ্যা",
      "explanation": "একটি মৌলিক সংখ্যা সোফি জার্মেইন হল এমন একটি মৌলিক সংখ্যা p যে সংখ্যা 2p+1 এবং মৌলিক। প্রাইম নাম্বার সোফি জার্মেইনের সাথে সম্পর্কিত সংখ্যা 2p+1 কে সেফ প্রাইম নাম্বার বলা হয়। উদাহরণস্বরূপ, 11 হল সোফি জার্মেইন মৌলিক সংখ্যা, এবং 2 × 11 + 1 = 23 হল সংশ্লিষ্ট নিরাপদ মৌলিক সংখ্যা।"
    },
    {
      "term": "সমমিত সংখ্যা",
      "explanation": "সমমিত সংখ্যা হল 1) সমস্ত এক অঙ্কের সংখ্যা, 2) xx আকারের দুটি সংখ্যার সংখ্যা, এবং 3) xyx আকারের তিনটি সংখ্যার সংখ্যা, যেখানে x, y হল অঙ্ক এবং x 0 হতে পারে না।"
    }
  ],
  "prefixToLink": "যাদুর সংখ্যা ক্রম সম্পর্কে আরও আকর্ষণীয় তথ্য উইকিপিডিয়া এবং সাইটে দেখুন "
}