{
  "title": "Επεξήγηση όρων",
  "explanations": [
    {
      "term": "Πρώτος αριθμός",
      "explanation": "Ένας πρώτος αριθμός είναι ένας φυσικός αριθμός μεγαλύτερος από το 1 που δεν είναι το γινόμενο δύο μικρότερων φυσικών αριθμών. Ένας φυσικός αριθμός μεγαλύτερος από το 1 που δεν είναι πρώτος αριθμός ονομάζεται σύνθετος αριθμός."
    },
    {
      "term": "Πυθαγόρειος πρώτος αριθμός",
      "explanation": "Ένας πυθαγόρειος πρώτος αριθμός είναι ένας πρώτος αριθμός της μορφής 4n + 1. Οι πυθαγόρειοι πρώτοι αριθμοί είναι ακριβώς οι περιττοί πρώτοι αριθμοί p για τους οποίους το 2 είναι πρωτόγονη ρίζα modulo p."
    },
    {
      "term": "Αριθμοί Fibonacci",
      "explanation": "Μια ακολουθία στην οποία κάθε αριθμός είναι το άθροισμα των δύο προηγούμενων αριθμών."
    },
    {
      "term": "Αριθμοί Tribonacci",
      "explanation": "Μια ακολουθία φυσικών αριθμών που ξεκινά με τον αριθμό 0 μία φορά και τον αριθμό 1 δύο φορές. Στη συνέχεια, το άθροισμα των τριών προηγούμενων αριθμών δίνει τον αμέσως επόμενο αριθμό: T0=0, T1=T2=1, Tn=Tn-1 + Tn-2 + Tn-3."
    },
    {
      "term": "Αριθμοί Bell",
      "explanation": "Ο αριθμός Bell είναι ο αριθμός των μη διατεταγμένων διαμερίσεων ενός συνόλου n στοιχείων, που υποδηλώνεται ως Bn, με την υπόθεση ότι B0=1. Ονομάστηκε προς τιμήν του Eric Bell, ο οποίος τους μελέτησε τη δεκαετία του 1930."
    },
    {
      "term": "Αριθμοί Catalan",
      "explanation": "Οι αριθμοί Catalan είναι μια αριθμητική ακολουθία που εμφανίζεται σε πολλά συνδυαστικά προβλήματα. Ονομάστηκαν προς τιμήν του Βέλγου μαθηματικού Eugène Charles Catalan, αν και ήταν γνωστοί στον Leonhard Euler. Ο n-οστός αριθμός Catalan Cn μπορεί να οριστεί με διάφορους ισοδύναμους τρόπους, όπως: 1) Ο αριθμός των διαμερίσεων ενός κυρτού (n+2)-γώνου σε τρίγωνα με μη επικαλυπτόμενες διαγώνιες. 2) Ο αριθμός των τρόπων σύνδεσης 2n σημείων σε έναν κύκλο με n μη επικαλυπτόμενες χορδές, κ.λπ."
    },
    {
      "term": "Αριθμοί Sophie Germain",
      "explanation": "Ένας πρώτος αριθμός Sophie Germain είναι ένας πρώτος αριθμός p τέτοιος ώστε ο αριθμός 2p+1 να είναι επίσης πρώτος αριθμός. Ο αριθμός 2p+1 που σχετίζεται με έναν πρώτο αριθμό Sophie Germain ονομάζεται ασφαλής πρώτος αριθμός. Για παράδειγμα, το 11 είναι ένας πρώτος αριθμός Sophie Germain, και το 2 × 11 + 1 = 23 είναι ο αντίστοιχος ασφαλής πρώτος αριθμός."
    },
    {
      "term": "Συμμετρικοί αριθμοί",
      "explanation": "Οι συμμετρικοί αριθμοί είναι: 1) όλοι οι μονοψήφιοι αριθμοί, 2) διψήφιοι αριθμοί της μορφής xx, και 3) τριψήφιοι αριθμοί της μορφής xyx, όπου x και y είναι ψηφία, και το x δεν μπορεί να είναι 0."
    }
  ],
  "prefixToLink": "Μπορείτε να βρείτε περισσότερες ενδιαφέρουσες πληροφορίες για μαγικές αριθμητικές ακολουθίες στη Wikipedia και στον ιστότοπο "
}