{
  "title": "توضیح اصطلاحات",
  "explanations": [
    {
      "term": "عدد اول",
      "explanation": "عدد اول عدد طبیعی بزرگتر از 1 است که حاصل ضرب دو عدد طبیعی کوچکتر نیست. عدد طبیعی بزرگتر از 1 که عدد اول نیست، عدد مرکب نامیده می‌شود."
    },
    {
      "term": "عدد اول فیثاغورثی",
      "explanation": "عدد اول فیثاغورثی عدد اولی به شکل 4n + 1 است. اعداد اول فیثاغورثی دقیقاً آن اعداد اول فرد p هستند که 2 ریشه اولیه مدول p است."
    },
    {
      "term": "اعداد فیبوناچی",
      "explanation": "دنباله‌ای که در آن هر عدد مجموع دو عدد قبلی است."
    },
    {
      "term": "اعداد تریبوناچی",
      "explanation": "دنباله‌ای از اعداد طبیعی که با عدد 0 یک بار و عدد 1 دو بار شروع می‌شود. سپس مجموع سه عدد قبلی عدد بعدی را می‌دهد: T0=0، T1=T2=1، Tn=Tn-1 + Tn-2 + Tn-3."
    },
    {
      "term": "اعداد بل",
      "explanation": "عدد بل تعداد تمام تقسیمات نامرتب یک مجموعه n عضوی است که با Bn نشان داده می‌شود، با فرض اینکه B0=1. به نام اریک بل که آنها را در دهه 1930 مطالعه کرد."
    },
    {
      "term": "اعداد کاتالان",
      "explanation": "اعداد کاتالان دنباله‌ای عددی هستند که در بسیاری از مسائل ترکیبی ظاهر می‌شوند. آنها به افتخار ریاضیدان بلژیکی اوژن چارلز کاتالان نامگذاری شده‌اند، اگرچه توسط لئونارد اویلر شناخته شده بودند. عدد n-ام کاتالان Cn می‌تواند به چندین روش معادل تعریف شود، مانند: 1) تعداد تقسیمات یک (n+2)-ضلعی محدب به مثلث‌ها با استفاده از قطرهای غیر متقاطع. 2) تعداد راه‌های اتصال 2n نقطه روی یک دایره با استفاده از n وتر غیر متقاطع، و غیره."
    },
    {
      "term": "اعداد سوفی ژرمن",
      "explanation": "عدد اول سوفی ژرمن عدد اولی p است که عدد 2p+1 نیز عدد اول است. عدد 2p+1 مرتبط با عدد اول سوفی ژرمن عدد اول ایمن نامیده می‌شود. به عنوان مثال، 11 یک عدد اول سوفی ژرمن است و 2 × 11 + 1 = 23 عدد اول ایمن مرتبط است."
    },
    {
      "term": "اعداد متقارن",
      "explanation": "اعداد متقارن عبارتند از: 1) همه اعداد یک رقمی، 2) اعداد دو رقمی به شکل xx، و 3) اعداد سه رقمی به شکل xyx، که در آن x و y ارقام هستند و x نمی‌تواند 0 باشد."
    }
  ],
  "prefixToLink": "برای اطلاعات بیشتر در مورد دنباله‌های عددی جادویی به ویکی‌پدیا و سایت مراجعه کنید "
}