{
  "title": "הסבר על מונחים",
  "explanations": [
    {
      "term": "מספר ראשוני",
      "explanation": "מספר ראשוני הוא מספר טבעי גדול מ-1 שאינו מכפלה של שני מספרים טבעיים קטנים יותר. מספר טבעי גדול מ-1 שאינו ראשוני נקרא מספר מורכב."
    },
    {
      "term": "מספר ראשוני פיתגוראי",
      "explanation": "מספר ראשוני פיתגוראי הוא מספר ראשוני מהצורה 4n + 1. מספרים ראשוניים פיתגוראיים הם בדיוק המספרים הראשוניים האי-זוגיים p שעבורם 2 הוא שורש פרימיטיבי מודולו p."
    },
    {
      "term": "מספרי פיבונאצ'י",
      "explanation": "סדרה שבה כל מספר הוא סכום של שני המספרים הקודמים."
    },
    {
      "term": "מספרי טריבונאצ'י",
      "explanation": "סדרה של מספרים טבעיים שמתחילה במספר 0 פעם אחת ובמספר 1 פעמיים. לאחר מכן, סכום שלושת המספרים הקודמים נותן את המספר הבא: T0=0, T1=T2=1, Tn=Tn-1 + Tn-2 + Tn-3."
    },
    {
      "term": "מספרי בל",
      "explanation": "מספר בל הוא מספר החלוקות הלא מסודרות של קבוצה של n אלמנטים, המסומן כ-Bn, בהנחה ש-B0=1. נקרא על שם אריק בל, שחקר אותם בשנות ה-30 של המאה ה-20."
    },
    {
      "term": "מספרי קטלן",
      "explanation": "מספרי קטלן הם סדרה מספרית שמופיעה בהרבה בעיות קומבינטוריות. הם נקראים על שם המתמטיקאי הבלגי אז'ן שארל קטלן, אם כי הם היו ידועים לליאונרד אוילר. המספר ה-n של קטלן Cn יכול להיות מוגדר בכמה דרכים שוות ערך, כגון: 1) מספר החלוקות של מצולע קמור (n+2)-צלעות למשולשים באמצעות אלכסונים שאינם חוצים. 2) מספר הדרכים לחבר 2n נקודות במעגל באמצעות n מיתרים שאינם חוצים, וכו'."
    },
    {
      "term": "מספרי סופי ז'רמן",
      "explanation": "מספר ראשוני סופי ז'רמן הוא מספר ראשוני p כזה שהמספר 2p+1 הוא גם מספר ראשוני. המספר 2p+1 הקשור למספר ראשוני סופי ז'רמן נקרא מספר ראשוני בטוח. לדוגמה, 11 הוא מספר ראשוני סופי ז'רמן, ו-2 × 11 + 1 = 23 הוא המספר הראשוני הבטוח הקשור."
    },
    {
      "term": "מספרים סימטריים",
      "explanation": "מספרים סימטריים הם: 1) כל המספרים בעלי ספרה אחת, 2) מספרים בעלי שתי ספרות מהצורה xx, ו-3) מספרים בעלי שלוש ספרות מהצורה xyx, כאשר x ו-y הם ספרות, ו-x לא יכול להיות 0."
    }
  ],
  "prefixToLink": "ניתן למצוא מידע מעניין נוסף על סדרות מספרים קסומות בוויקיפדיה ובאתר "
}