{
  "title": "ਸ਼ਬਦਾਵਲੀ ਦੀ ਵਿਆਖਿਆ",
  "explanations": [
    {
      "term": "ਪ੍ਰਾਈਮ ਨੰਬਰ",
      "explanation": "ਪ੍ਰਾਈਮ ਨੰਬਰ ਇੱਕ ਕੁਦਰਤੀ ਨੰਬਰ ਹੈ ਜੋ 1 ਤੋਂ ਵੱਡਾ ਹੈ ਜੋ ਦੋ ਛੋਟੇ ਕੁਦਰਤੀ ਨੰਬਰਾਂ ਦਾ ਗੁਣਨਫਲ ਨਹੀਂ ਹੈ। ਇੱਕ ਕੁਦਰਤੀ ਨੰਬਰ ਜੋ 1 ਤੋਂ ਵੱਡਾ ਹੈ ਜੋ ਪ੍ਰਾਈਮ ਨੰਬਰ ਨਹੀਂ ਹੈ, ਉਸਨੂੰ ਸੰਯੁਕਤ ਨੰਬਰ ਕਿਹਾ ਜਾਂਦਾ ਹੈ।"
    },
    {
      "term": "ਪਾਈਥਾਗੋਰਸ ਪ੍ਰਾਈਮ ਨੰਬਰ",
      "explanation": "ਪਾਈਥਾਗੋਰਸ ਪ੍ਰਾਈਮ ਨੰਬਰ 4n + 1 ਦੇ ਰੂਪ ਦਾ ਪ੍ਰਾਈਮ ਨੰਬਰ ਹੈ। ਪਾਈਥਾਗੋਰਸ ਪ੍ਰਾਈਮ ਨੰਬਰ ਸਹੀ ਤੌਰ 'ਤੇ ਉਹ ਅਜੀਬ ਪ੍ਰਾਈਮ ਨੰਬਰ ਹਨ p ਜਿਨ੍ਹਾਂ ਲਈ 2 ਮੋਡੀਲੋ p ਦਾ ਪ੍ਰਮੁੱਖ ਜੜ੍ਹ ਹੈ।"
    },
    {
      "term": "ਫਿਬੋਨਾਚੀ ਨੰਬਰ",
      "explanation": "ਇੱਕ ਲੜੀ ਜਿਸ ਵਿੱਚ ਹਰ ਨੰਬਰ ਪਿਛਲੇ ਦੋ ਨੰਬਰਾਂ ਦਾ ਜੋੜ ਹੁੰਦਾ ਹੈ।"
    },
    {
      "term": "ਟ੍ਰਿਬੋਨਾਚੀ ਨੰਬਰ",
      "explanation": "ਕੁਦਰਤੀ ਨੰਬਰਾਂ ਦੀ ਇੱਕ ਲੜੀ ਜੋ ਇੱਕ ਵਾਰ 0 ਨੰਬਰ ਅਤੇ ਦੋ ਵਾਰ 1 ਨੰਬਰ ਨਾਲ ਸ਼ੁਰੂ ਹੁੰਦੀ ਹੈ। ਫਿਰ ਪਿਛਲੇ ਤਿੰਨ ਨੰਬਰਾਂ ਦਾ ਜੋੜ ਅਗਲਾ ਨੰਬਰ ਦਿੰਦਾ ਹੈ: T0=0, T1=T2=1, Tn=Tn-1 + Tn-2 + Tn-3."
    },
    {
      "term": "ਬੈਲ ਨੰਬਰ",
      "explanation": "ਬੈਲ ਨੰਬਰ n-ਤੱਤਾਂ ਵਾਲੇ ਸੈੱਟ ਦੇ ਸਾਰੇ ਬੇਤਰਤੀਬੇ ਵਿਭਾਜਨਾਂ ਦੀ ਗਿਣਤੀ ਹੈ, ਜਿਸਨੂੰ Bn ਦੇ ਤੌਰ 'ਤੇ ਦਰਸਾਇਆ ਜਾਂਦਾ ਹੈ, ਇਹ ਧਾਰਨਾ ਕਰਦੇ ਹੋਏ ਕਿ B0=1. ਇਹਨਾਂ ਦਾ ਅਧਿਐਨ ਕਰਨ ਵਾਲੇ ਐਰਿਕ ਬੈਲ ਦੇ ਨਾਮ 'ਤੇ ਰੱਖਿਆ ਗਿਆ।"
    },
    {
      "term": "ਕੈਟਾਲਾਨ ਨੰਬਰ",
      "explanation": "ਕੈਟਾਲਾਨ ਨੰਬਰ ਇੱਕ ਅੰਕ ਲੜੀ ਹੈ ਜੋ ਬਹੁਤ ਸਾਰੇ ਸੰਯੋਜਕ ਸਮੱਸਿਆਵਾਂ ਵਿੱਚ ਪ੍ਰਗਟ ਹੁੰਦੀ ਹੈ। ਇਹਨਾਂ ਨੂੰ ਬੈਲਜੀਅਮ ਦੇ ਗਣਿਤਜੋਗ ਯੂਜੀਨ ਚਾਰਲਜ਼ ਕੈਟਾਲਾਨ ਦੇ ਸਨਮਾਨ ਵਿੱਚ ਨਾਮ ਦਿੱਤਾ ਗਿਆ ਹੈ, ਹਾਲਾਂਕਿ ਇਹ ਲਿਓਨਾਰਡ ਈਲਰ ਦੁਆਰਾ ਜਾਣੇ ਜਾਂਦੇ ਸਨ। n-ਵਾਂ ਕੈਟਾਲਾਨ ਨੰਬਰ Cn ਕਈ ਸਮਾਨ ਤਰੀਕਿਆਂ ਨਾਲ ਪਰਿਭਾਸ਼ਿਤ ਕੀਤਾ ਜਾ ਸਕਦਾ ਹੈ, ਜਿਵੇਂ ਕਿ: 1) ਗੈਰ-ਅਤੇਕਰਮਿਕ ਤੀਰਾਂ ਦੀ ਵਰਤੋਂ ਕਰਕੇ ਇੱਕ ਉਭਰਦੇ (n+2)-ਭੁਜਾ ਦਾ ਤਿਕੋਣ ਵਿੱਚ ਵਿਭਾਜਨ ਦੀ ਗਿਣਤੀ। 2) n ਗੈਰ-ਅਤੇਕਰਮਿਕ ਤੀਰਾਂ ਦੀ ਵਰਤੋਂ ਕਰਕੇ ਇੱਕ ਵਰਤੁੱਲ ਵਿੱਚ 2n ਬਿੰਦੂਆਂ ਨੂੰ ਜੋੜਨ ਦੇ ਤਰੀਕਿਆਂ ਦੀ ਗਿਣਤੀ, ਆਦਿ।"
    },
    {
      "term": "ਸੋਫੀ ਜਰਮੈਨ ਨੰਬਰ",
      "explanation": "ਸੋਫੀ ਜਰਮੈਨ ਪ੍ਰਾਈਮ ਨੰਬਰ ਇੱਕ ਪ੍ਰਾਈਮ ਨੰਬਰ p ਹੈ ਜਿਸ ਵਿੱਚ 2p+1 ਨੰਬਰ ਵੀ ਪ੍ਰਾਈਮ ਹੈ। ਸੋਫੀ ਜਰਮੈਨ ਪ੍ਰਾਈਮ ਨੰਬਰ ਨਾਲ ਸੰਬੰਧਿਤ 2p+1 ਨੰਬਰ ਨੂੰ ਸੁਰੱਖਿਅਤ ਪ੍ਰਾਈਮ ਨੰਬਰ ਕਿਹਾ ਜਾਂਦਾ ਹੈ। ਉਦਾਹਰਣ ਲਈ, 11 ਇੱਕ ਸੋਫੀ ਜਰਮੈਨ ਪ੍ਰਾਈਮ ਨੰਬਰ ਹੈ, ਅਤੇ 2 × 11 + 1 = 23 ਸੰਬੰਧਤ ਸੁਰੱਖਿਅਤ ਪ੍ਰਾਈਮ ਨੰਬਰ ਹੈ।"
    },
    {
      "term": "ਸਮਮਿਤੀ ਨੰਬਰ",
      "explanation": "ਸਮਮਿਤੀ ਨੰਬਰ ਹਨ: 1) ਸਾਰੇ ਇੱਕ ਅੰਕ ਵਾਲੇ ਨੰਬਰ, 2) xx ਦੇ ਰੂਪ ਦੇ ਦੋ ਅੰਕ ਵਾਲੇ ਨੰਬਰ, ਅਤੇ 3) xyx ਦੇ ਰੂਪ ਦੇ ਤਿੰਨ ਅੰਕ ਵਾਲੇ ਨੰਬਰ, ਜਿੱਥੇ x ਅਤੇ y ਅੰਕ ਹਨ, ਅਤੇ x 0 ਨਹੀਂ ਹੋ ਸਕਦਾ।"
    }
  ],
  "prefixToLink": "ਜਾਦੂਈ ਅੰਕ ਲੜੀਆਂ ਬਾਰੇ ਹੋਰ ਦਿਲਚਸਪ ਜਾਣਕਾਰੀ ਲਈ ਵਿਕੀਪੀਡੀਆ ਅਤੇ ਸਾਈਟ 'ਤੇ ਵੇਖੋ "
}