{
  "title": "Объяснение терминов",
  "explanations": [
    {
      "term": "Простое число",
      "explanation": "Простое число — это натуральное число больше 1, которое не является произведением двух меньших натуральных чисел. Натуральное число больше 1, которое не является простым, называется составным числом."
    },
    {
      "term": "Пифагорово простое число",
      "explanation": "Пифагорово простое число — это простое число вида 4n + 1. Пифагоровы простые числа — это именно те нечетные простые числа p, для которых 2 является примитивным корнем по модулю p."
    },
    {
      "term": "Числа Фибоначчи",
      "explanation": "Последовательность, в которой каждое число является суммой двух предыдущих."
    },
    {
      "term": "Числа Трибоначчи",
      "explanation": "Последовательность натуральных чисел, которая начинается с числа 0 один раз и числа 1 дважды. Затем сумма трех предыдущих чисел дает следующее число: T0=0, T1=T2=1, Tn=Tn-1 + Tn-2 + Tn-3."
    },
    {
      "term": "Числа Белла",
      "explanation": "Число Белла — это количество неупорядоченных разбиений множества из n элементов, обозначаемое как Bn, при условии, что B0=1. Названо в честь Эрика Белла, который изучал их в 1930-х годах."
    },
    {
      "term": "Числа Каталана",
      "explanation": "Числа Каталана — это числовая последовательность, которая встречается во многих комбинаторных задачах. Они названы в честь бельгийского математика Эжена Шарля Каталана, хотя они были известны Леонарду Эйлеру. n-е число Каталана Cn может быть определено несколькими эквивалентными способами, например: 1) Количество разбиений выпуклого (n+2)-угольника на треугольники с помощью непересекающихся диагоналей. 2) Количество способов соединить 2n точек на окружности с помощью n непересекающихся аккордов и т.д."
    },
    {
      "term": "Числа Софи Жермен",
      "explanation": "Простое число Софи Жермен — это такое простое число p, что число 2p+1 также является простым. Число 2p+1, связанное с простым числом Софи Жермен, называется безопасным простым числом. Например, 11 — это простое число Софи Жермен, а 2 × 11 + 1 = 23 — это связанное безопасное простое число."
    },
    {
      "term": "Симметричные числа",
      "explanation": "Симметричные числа — это: 1) все однозначные числа, 2) двузначные числа вида xx и 3) трехзначные числа вида xyx, где x и y — цифры, и x не может быть 0."
    }
  ],
  "prefixToLink": "Для получения дополнительной интересной информации о магических числовых последовательностях см. Википедию и сайт "
}