{
  "title": "Објашњење термина",
  "explanations": [
    {
      "term": "Прост број",
      "explanation": "Прост број је природан број већи од 1 који није производ два мања природна броја. Природан број већи од 1 који није прост број назива се сложен број."
    },
    {
      "term": "Питагорејски прост број",
      "explanation": "Питагорејски прост број је прост број облика 4n + 1. Питагорејски прост бројеви су управо они непарни прост бројеви p за које је 2 примитиван корен по модулу p."
    },
    {
      "term": "Фибоначијеви бројеви",
      "explanation": "Низ у којем је сваки број збир два претходна броја."
    },
    {
      "term": "Трибоначијеви бројеви",
      "explanation": "Низ природних бројева који почиње бројем 0 једном и бројем 1 два пута. Затим је збир три претходна броја следећи број: T0=0, T1=T2=1, Tn=Tn-1 + Tn-2 + Tn-3."
    },
    {
      "term": "Беллови бројеви",
      "explanation": "Беллов број је број неуређених партиција скупа од n елемената, означен као Bn, са претпоставком да је B0=1. Назван по Ерику Беллу, који их је проучавао 1930-их година."
    },
    {
      "term": "Каталанови бројеви",
      "explanation": "Каталанови бројеви су нумерички низ који се појављује у многим комбинаторним проблемима. Названи су у част белгијског математичара Ежена Шарла Каталана, иако су били познати Леонарду Ојлеру. n-ти Каталанов број Cn може се дефинисати на неколико еквивалентних начина, као што су: 1) Број партиција конвексног (n+2)-гона на троуглове помоћу непоклапајућих дијагонала. 2) Број начина да се повеже 2n тачака на кругу помоћу n непоклапајућих акорда, итд."
    },
    {
      "term": "Софи Жерменови бројеви",
      "explanation": "Прост број Софи Жермен је такав прост број p да је број 2p+1 такође прост. Број 2p+1 повезан са простим бројем Софи Жермен назива се сигуран прост број. На пример, 11 је прост број Софи Жермен, а 2 × 11 + 1 = 23 је повезан сигуран прост број."
    },
    {
      "term": "Симетрични бројеви",
      "explanation": "Симетрични бројеви су: 1) сви једноцифрени бројеви, 2) двоцифрени бројеви облика xx и 3) троцифрени бројеви облика xyx, где су x и y цифре, а x не може бити 0."
    }
  ],
  "prefixToLink": "За више занимљивих информација о магичним бројевним низовима погледајте Википедију и сајт "
}