{
  "title": "คำอธิบายของคำศัพท์",
  "explanations": [
    {
      "term": "จำนวนเฉพาะ",
      "explanation": "จำนวนเฉพาะคือจำนวนธรรมชาติที่มากกว่า 1 ซึ่งไม่ใช่ผลคูณของจำนวนธรรมชาติที่เล็กกว่าสองจำนวน จำนวนธรรมชาติที่มากกว่า 1 ซึ่งไม่ใช่จำนวนเฉพาะเรียกว่าจำนวนประกอบ"
    },
    {
      "term": "จำนวนเฉพาะแบบพีทาโกรัส",
      "explanation": "จำนวนเฉพาะแบบพีทาโกรัสคือจำนวนเฉพาะที่มีรูปแบบ 4n + 1 จำนวนเฉพาะแบบพีทาโกรัสคือจำนวนเฉพาะที่เป็นจำนวนคี่ p ซึ่ง 2 เป็นรากดั้งเดิมของ p"
    },
    {
      "term": "จำนวนฟีโบนักชี",
      "explanation": "ลำดับที่แต่ละจำนวนเป็นผลรวมของสองจำนวนก่อนหน้า"
    },
    {
      "term": "จำนวนทริโบนักชี",
      "explanation": "ลำดับของจำนวนธรรมชาติที่เริ่มต้นด้วยจำนวน 0 หนึ่งครั้งและจำนวน 1 สองครั้ง จากนั้นผลรวมของสามจำนวนก่อนหน้าจะเป็นจำนวนถัดไป: T0=0, T1=T2=1, Tn=Tn-1 + Tn-2 + Tn-3"
    },
    {
      "term": "จำนวนเบลล์",
      "explanation": "จำนวนเบลล์คือจำนวนของการแบ่งส่วนที่ไม่เรียงลำดับของชุดของ n องค์ประกอบที่ระบุว่า Bn โดยมีสมมติฐานว่า B0=1 ตั้งชื่อตาม Eric Bell ผู้ศึกษาในทศวรรษที่ 1930"
    },
    {
      "term": "จำนวนคาตาลัน",
      "explanation": "จำนวนคาตาลันเป็นลำดับตัวเลขที่ปรากฏในปัญหาการจัดกลุ่มหลายอย่าง ตั้งชื่อตามนักคณิตศาสตร์ชาวเบลเยียม Eugène Charles Catalan แม้ว่าจะเป็นที่รู้จักของ Leonhard Euler จำนวนคาตาลันที่ n สามารถกำหนดได้หลายวิธีที่เทียบเท่ากัน เช่น: 1) จำนวนการแบ่งส่วนของรูปหลายเหลี่ยม (n+2) ที่นูนเป็นสามเหลี่ยมโดยใช้เส้นทแยงมุมที่ไม่ทับซ้อนกัน 2) จำนวนวิธีในการเชื่อมต่อ 2n จุดบนวงกลมโดยใช้คอร์ดที่ไม่ทับซ้อนกัน n เป็นต้น"
    },
    {
      "term": "จำนวนโซฟี เจอร์เมน",
      "explanation": "จำนวนเฉพาะของ Sophie Germain คือจำนวนเฉพาะ p ที่จำนวน 2p+1 ก็เป็นจำนวนเฉพาะเช่นกัน จำนวน 2p+1 ที่เกี่ยวข้องกับจำนวนเฉพาะของ Sophie Germain เรียกว่าจำนวนเฉพาะที่ปลอดภัย ตัวอย่างเช่น 11 เป็นจำนวนเฉพาะของ Sophie Germain และ 2 × 11 + 1 = 23 เป็นจำนวนเฉพาะที่ปลอดภัยที่เกี่ยวข้อง"
    },
    {
      "term": "จำนวนสมมาตร",
      "explanation": "จำนวนสมมาตรคือ: 1) จำนวนหลักเดียวทั้งหมด 2) จำนวนสองหลักในรูปแบบ xx และ 3) จำนวนสามหลักในรูปแบบ xyx โดยที่ x และ y เป็นตัวเลข และ x ไม่สามารถเป็น 0 ได้"
    }
  ],
  "prefixToLink": "สำหรับข้อมูลที่น่าสนใจเพิ่มเติมเกี่ยวกับลำดับตัวเลขที่มีมนต์ขลัง โปรดดูที่ Wikipedia และเว็บไซต์ "
}