{
  "title": "Пояснення термінів",
  "explanations": [
    {
      "term": "Просте число",
      "explanation": "Просте число - це натуральне число більше 1, яке не є добутком двох менших натуральних чисел. Натуральне число більше 1, яке не є простим, називається складеним числом."
    },
    {
      "term": "Піфагорійське просте число",
      "explanation": "Піфагорійське просте число - це просте число форми 4n + 1. Піфагорійські прості числа - це саме ті непарні прості числа p, для яких 2 є примітивним коренем за модулем p."
    },
    {
      "term": "Числа Фібоначчі",
      "explanation": "Послідовність, у якій кожне число є сумою двох попередніх."
    },
    {
      "term": "Числа Трибоначчі",
      "explanation": "Послідовність натуральних чисел, яка починається з числа 0 один раз і числа 1 двічі. Потім сума трьох попередніх чисел дає наступне число: T0=0, T1=T2=1, Tn=Tn-1 + Tn-2 + Tn-3"
    },
    {
      "term": "Числа Белла",
      "explanation": "Число Белла - це кількість неупорядкованих розбиттів множини з n елементів, позначених як Bn, за умови, що B0=1. Названо на честь Еріка Белла, який вивчав їх у 1930-х роках."
    },
    {
      "term": "Числа Каталана",
      "explanation": "Числа Каталана - це числова послідовність, яка зустрічається у багатьох комбінаторних задачах. Вони названі на честь бельгійського математика Ежена Шарля Каталана, хоча вони були відомі Леонарду Ейлеру. n-те число Каталана Cn можна визначити кількома еквівалентними способами, наприклад: 1) Кількість розбиттів опуклого (n+2)-кутника на трикутники за допомогою неперетинаючихся діагоналей. 2) Кількість способів з'єднання 2n точок на колі за допомогою n неперетинаючихся акордів тощо."
    },
    {
      "term": "Числа Софі Жермен",
      "explanation": "Просте число Софі Жермен - це таке просте число p, що число 2p+1 також є простим. Число 2p+1, пов'язане з простим числом Софі Жермен, називається безпечним простим числом. Наприклад, 11 - це просте число Софі Жермен, а 2 × 11 + 1 = 23 - це пов'язане безпечне просте число."
    },
    {
      "term": "Симетричні числа",
      "explanation": "Симетричні числа - це: 1) всі однозначні числа, 2) двозначні числа форми xx, і 3) тризначні числа форми xyx, де x і y - цифри, і x не може бути 0."
    }
  ],
  "prefixToLink": "Для отримання додаткової цікавої інформації про магічні числові послідовності дивіться Вікіпедію та веб-сайт "
}